#include "shell.h"      // 声明 shell_run()
#include "uart.h"       // 使用 uart_puts() 输出字符
#include "console.h"    // 使用 console_readline() 获取用户输入
#include "string.h"     // 使用我们自己实现的 strcmp()


// ============================================================
// 1. hello 命令
// ============================================================
//
// 用户输入：
// MiniOS> hello
//
// 最终执行这个函数。
//
// 所有命令函数统一设计成：
// void xxx(const char *argument)
//
// argument 用来接收命令后面的参数。
// 例如：
// echo abc
//
// argument -> "abc"
//
// hello 命令暂时不需要参数。
static void cmd_hello(const char *argument)
{
    // hello 不需要使用 argument。
    //
    // 写这一行的作用只是告诉编译器：
    // “这个参数我知道存在，只是暂时不用。”
    (void)argument;

    // 输出 hello 命令执行结果
    uart_puts("Hello RISC-V\n");
}


// ============================================================
// 2. help 命令
// ============================================================
//
// 用户输入：
// MiniOS> help
//
// 显示目前支持的命令。
static void cmd_help(const char *argument)
{
    // help 目前也不需要参数
    (void)argument;

    uart_puts("Commands:\n");
    uart_puts("hello\n");
    uart_puts("help\n");
    uart_puts("echo <text>\n");
}


// ============================================================
// 3. echo 命令
// ============================================================
//
// 例如用户输入：
//
// MiniOS> echo hello
//
// parse_command() 解析以后：
//
// command  -> "echo"
// argument -> "hello"
//
// 然后会执行：
//
// cmd_echo("hello");
//
static void cmd_echo(const char *argument)
{
    // argument == 0
    //
    // 表示用户只输入：
    // echo
    //
    // 后面没有参数。
    if (argument == 0)
    {
        // 没有内容就只输出一个换行
        uart_puts("\n");

        // 函数结束
        return;
    }

    // 有参数，例如：
    //
    // argument -> "hello"
    //
    // 就直接打印它
    uart_puts(argument);

    // 打印结束后换行
    uart_puts("\n");
}


// ============================================================
// 4. 定义“一条命令”长什么样
// ============================================================
//
// 一条命令需要两个信息：
//
// ① 命令叫什么
// ② 输入这个命令以后执行哪个函数
//
// 例如：
//
// "hello"  -> cmd_hello
// "help"   -> cmd_help
// "echo"   -> cmd_echo
//
struct command
{
    // 命令名称
    //
    // 例如：
    // name -> "hello"
    const char *name;


    // 函数指针
    //
    // func 里面保存的是一个函数的地址。
    //
    // 这个函数必须长成：
    //
    // void xxx(const char *argument)
    //
    // 所以：
    // cmd_hello
    // cmd_help
    // cmd_echo
    //
    // 都可以放进这里。
    void (*func)(const char *argument);
};


// ============================================================
// 5. 命令表
// ============================================================
//
// 可以把它理解成一张对应表：
//
// 命令名字        对应函数
// --------------------------------
// hello           cmd_hello
// help            cmd_help
// echo            cmd_echo
//
static struct command cmd_table[] =
{
    { "hello", cmd_hello },
    { "help",  cmd_help  },
    { "echo",  cmd_echo  }
};


// ============================================================
// 6. 解析用户输入
// ============================================================
//
// 这个函数负责把：
//
// "echo hello"
//
// 拆成：
//
// command  -> "echo"
// argument -> "hello"
//
//
// 参数说明：
//
// line
//     用户输入的一整行
//
// command
//     用来返回“命令名”
//
// argument
//     用来返回“参数”
//
//
// 为什么是 char **？
//
// shell_run() 里面有：
//
// char *command;
// char *argument;
//
// parse_command() 想修改这两个变量，
// 所以传进来的是它们自己的地址：
//
// &command
// &argument
//
// 因此这里需要用 char ** 接收。
//
static void parse_command(
    char *line,
    char **command,
    char **argument)
{
    // i 用来一个字符一个字符检查 line
    int i = 0;


    // 一开始，
    // 命令肯定从这一整行的第一个字符开始。
    //
    // 例如：
    //
    // line
    // ↓
    // e c h o   h e l l o
    //
    // 所以：
    //
    // command -> line
    //
    // 也就是：
    //
    // command -> "echo hello"
    //
    // 后面我们再把空格切开。
    *command = line;


    // --------------------------------------------------------
    // 从头寻找第一个空格
    // --------------------------------------------------------
    //
    // 例如：
    //
    // echo hello
    //     ^
    //     找到这里
    //
    // 如果没找到空格，就会走到 '\0'。
    while (line[i] != '\0' && line[i] != ' ')
    {
        // 查看下一个字符
        i++;
    }


    // --------------------------------------------------------
    // 情况1：没有找到空格
    // --------------------------------------------------------
    //
    // 例如用户输入：
    //
    // hello
    //
    // 内存：
    //
    // h e l l o \0
    //
    // 一直走到 '\0' 都没有空格。
    if (line[i] == '\0')
    {
        // 没有参数
        //
        // command 已经指向：
        // "hello"
        //
        // argument 设置成 0，
        // 表示“没有参数”。
        *argument = 0;

        return;
    }


    // --------------------------------------------------------
    // 情况2：找到了空格
    // --------------------------------------------------------
    //
    // 例如：
    //
    // echo hello
    //
    // 原来内存：
    //
    // [e][c][h][o][ ][h][e][l][l][o][\0]
    //             ^
    //             i
    //
    // 把空格改成 '\0'
    line[i] = '\0';
    i++;  // 跳过空格，指向参数的第一个字符
    while (line[i] == ' ')
    {
        // 如果参数前面还有空格，就继续跳过
        i++;
    }
    if (line[i] == '\0')
    {
        // 如果参数前面全是空格，
        // 最后走到 '\0'，
        // 也当作“没有参数”。
        *argument = 0;
        return;
    }   

    // 改完以后：
    //
    // [e][c][h][o][\0][h][e][l][l][o][\0]
    //
    // 现在同一块数组里面实际上出现了两个字符串：
    //
    // "echo"
    //
    // "hello"


    // 参数从原来空格后面的那个字符开始。
    //
    // &line[i + 1]
    //
    // 指向：
    //
    // 'h'
    //
    // 所以：
    //
    // argument -> "hello"
    *argument = &line[i];


    // 如果用户输入的是：
    //
    // echo
    //
    // 后面只有一个空格，没有真正参数，
    // 那 argument 会指向 '\0'。
    //
    // 这里把这种情况也当成“没有参数”。
    if (**argument == '\0')
    {
        *argument = 0;
    }
}


// ============================================================
// 7. Shell 主循环
// ============================================================
//
// shell_run() 一旦进入以后，就会一直：
//
// 显示提示符
// ↓
// 等用户输入
// ↓
// 解析命令
// ↓
// 查命令表
// ↓
// 执行
// ↓
// 再显示提示符
//
void shell_run(void)
{
    char line[64];
    
    
    // 保存 Console 交给我们的完整一行。
    //
    // 例如：
    //
    // line = "echo hello"
    


    // 保存解析后的命令名。
    //
    // 例如：
    //
    // command -> "echo"
    char *command;


    // 保存解析后的参数。
    //
    // 例如：
    //
    // argument -> "hello"
    char *argument;


    // 遍历命令表用
    int i;


    // 第一次显示命令提示符。
    //
    // 注意：
    // "MiniOS> " 只是打印到屏幕上的普通字符串，
    // 不会进入用户输入缓冲区。
    uart_puts("MiniOS> ");


    // Shell 永远运行
    while (1)
    {
        
        // ====================================================
        // 第一步：尝试读取一整行
        // ====================================================
        //
        // 用户还没按 Enter：
        //
        // console_readline() 返回 0
        //
        // 用户按 Enter：
        //
        // console_readline() 把输入复制到 line，
        // 然后返回 1。
        if (!console_readline(line, sizeof(line)))
        {
            // 没有完整输入
            // 继续等待
            continue;
        }
        
        // 用户刚按了 Enter，
        // Shell 的执行结果从下一行显示。
        uart_puts("\n");
        
        if (line[0] == '\0')
        {
            // 用户什么都没输入，只按了 Enter

            uart_puts("MiniOS> ");

            // 回去继续等待下一次输入
            continue;
        }

        // ====================================================
        // 第二步：解析命令
        // ====================================================
        //
        // 假设：
        //
        // line = "echo hello"
        //
        // 调用以后：
        //
        // command  -> "echo"
        // argument -> "hello"
        //
        // 注意：
        //
        // &command
        // 表示 command 变量自己的地址
        //
        // &argument
        // 表示 argument 变量自己的地址
        parse_command(line, &command, &argument);


        // 默认认为：
        // 还没有找到对应命令。
        //
        // 0 = 没找到
        // 1 = 找到了
        int found = 0;


        // ====================================================
        // 第三步：查命令表
        // ====================================================
        //
        // 当前有3个命令：
        //
        // 0 hello
        // 1 help
        // 2 echo
        for (i = 0; i < 3; i++)
        {
            // 比较：
            //
            // 用户输入的命令名
            //
            // command
            //
            // 和：
            //
            // 命令表里的名字
            //
            // cmd_table[i].name
            //
            // strcmp() 返回0表示完全相同。
            if (strcmp(command, cmd_table[i].name) == 0)
            {
                // ============================================
                // 第四步：执行对应命令
                // ============================================
                //
                // 例如：
                //
                // command = "echo"
                //
                // 找到：
                //
                // cmd_table[2]
                //
                // func = cmd_echo
                //
                // 所以下面这一行实际相当于：
                //
                // cmd_echo(argument);
                //
                // 如果：
                //
                // argument -> "hello"
                //
                // 实际就是：
                //
                // cmd_echo("hello");
                cmd_table[i].func(argument);


                // 标记：
                // 已经成功找到命令。
                found = 1;


                // 已经找到了，
                // 不需要继续检查后面的命令。
                break;
            }
        }


        // ====================================================
        // 第五步：处理未知命令
        // ====================================================
        //
        // 如果整个命令表都检查完，
        // found 仍然是0，
        // 说明用户输入了不存在的命令。
        if (!found)
        {
            uart_puts("Unknown command: ");

            // 把用户输入的命令打印出来
            uart_puts(command);

            uart_puts("\n");
        }


        // ====================================================
        // 第六步：重新显示提示符
        // ====================================================
        //
        // 当前命令已经处理完。
        //
        // 等待下一条命令。
        uart_puts("MiniOS> ");
    }
}